class example_02_03
{
    public static void main(String args[])//начало программы
    {
        int S, D;//объявление переменных S и D
        S = 10;// присвоение переменной S значение 10
        D = 20;// присвоение переменной D значения 20
        if(S < D) System.out.println("S < D");//если значение S  меньше значения D,то выводится строка S<D
        S = S * 2;//умножение значения переменной D на 2
        if(S == D) System.out.println("S = D");//если значение S равно значению D,то выводится строка S=D
        S = S * D;//умножение значения переменной S на значение переменной D
        if(S > D) System.out.println("S > D");// если значение переменной S ,чем значение переменной D,то выводится строка S>D

    }
}//конец программы
