class example_02_02{
    public static void main(String args[])//начало программы
    {
        int num; // в этой строке кода объявляется переменная с именем num
        num = 100; // в этой строке кода переменной num присваивается значение 100
        System.out.println("num: " + num);//выводится строка,сообщающая,что переменной num присвоено значение 100
        num = num * 2;//умножение переменной num на 2
        System.out.print("Znachenie num * 2 равно ");// вывод строки на экран с сообщением значения предыдущей операции программы
        System.out.println(num);
    }
} //конец программы