/*Напишите программу, в которой есть суперкласс с защищенным текстовым полем,
конструктор с текстовым параметром и метод, при вызове которого в консольном окне отображается название класса и значение поля.
На основе суперкласса создаются два подкласса (оба на основе одного и того же суперкласса).
В одном из классов появляется защищенное целочисленное поле,
там есть конструктор с двумя параметрами и переопределен метод для отображения значений полей объекта и названия класса.
Во втором подклассе появляется защищенное символьное поле, конструктор с двумя параметрами и переопределен метод,
отображающий в консоли название класса и значения полей. В главном методе создайте объекты каждого из классов.
Проверьте работу метода, отображающего значения полей объектов, для каждого из объектов.
Вызовите этот же метод через объектную переменную суперкласса, которая ссылается на объект производного класса.*/
public class example_02_75{
   public static void main(String[] args) {
            example_02_75_SuperClass superClassObject = new example_02_75_SuperClass("передал в конструктор суперкласса");
            String className = superClassObject.toString();
            System.out.println(className);

       example_02_75_SubOneClass subClassObject = new example_02_75_SubOneClass("передал в конструктор подкласса");
            String ClassName = subClassObject.toString();
            System.out.println(ClassName);
        }
    }
